announcements/rich-notes-for-smart-learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-14 Fri 08:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learn Smarter By Taking Rich, Hypertext Notes</title>
<meta name="author" content="T.V Raman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Learn Smarter By Taking Rich, Hypertext Notes</h1>
<div id="outline-container-org77507eb" class="outline-2">
<h2 id="org77507eb"><span class="section-number-2">1.</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
As a student, I learnt to take <a href="https://www.cs.cornell.edu/info/people/raman/phd-thesis/html/root-thesis.html">notes in Braille</a> while in class and
while lerning from audio books.   When reviewing the material, reading
the notes was far more efficient than re-listening to the original
recordings; however at the time, I had no means to easily jump to the
original content when perusing my notes.
</p>

<p>
Fast-forward to the age of online computing, a complete audio desktop
in the form of Emacspeak, a wealth of online resources in the form of
E-Books, Audio Books, Podcasts and Blogs, all backed by Universal
Search accessible from a consistent environment. So I've been asking
myself what <i>note-taking</i> in this environment should look like.  This
article summarizes the present state of what I use at present.
</p>
</div>
</div>

<div id="outline-container-org747ee7c" class="outline-2">
<h2 id="org747ee7c"><span class="section-number-2">2.</span> Use Case Requirements</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>All of the following should work equally well for locally stored
material, e.g., downloaded EBooks from Bookshare or Project
Gutenberg, as well as material hosted on the Internet in the form of
Blogs and Podcasts.</li>
<li>Create named bookmarks in E-Books (EPub, Daisy).</li>
<li>Create  AMarks —bookmarks  that point to positions in an audio files.</li>
<li>Above should be possible independent of whether the learning
material is available locally, or accessed via the Internet.</li>
<li>Enable the creation of hyperlinks to such bookmarks.</li>
<li>Enable the easy creation of notes — organized by topic — while
reading EBooks  or listening to  audio material.</li>
<li>Enable the embedding of hyperlinks to the bookmarks mentioned
earlier within these notes.</li>
<li>Final experience: creation of notes should require minimal
effort; when reding the notes, it should be  easy to open the
relevant portion of the content that underlies the notes.</li>
</ol>


<p>
being 
</p>
</div>
</div>

<div id="outline-container-org2ce1a25" class="outline-2">
<h2 id="org2ce1a25"><span class="section-number-2">3.</span> User Experience</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0d9ee75" class="outline-3">
<h3 id="org0d9ee75"><span class="section-number-3">3.1.</span> Create And Browse Bookmarks In EBooks</h3>
</div>

<div id="outline-container-org552b260" class="outline-3">
<h3 id="org552b260"><span class="section-number-3">3.2.</span> Create And Browse AMarks In Audio Books</h3>
</div>

<div id="outline-container-org912b42f" class="outline-3">
<h3 id="org912b42f"><span class="section-number-3">3.3.</span> Create Bookmarks  On Web Pages</h3>
</div>

<div id="outline-container-org5ac8736" class="outline-3">
<h3 id="org5ac8736"><span class="section-number-3">3.4.</span> Create Audio Bookmarks In Podcasts</h3>
</div>

<div id="outline-container-org2f5db7a" class="outline-3">
<h3 id="org2f5db7a"><span class="section-number-3">3.5.</span> Create On-Line Notes Using Org-Mode</h3>
</div>

<div id="outline-container-org45780a4" class="outline-3">
<h3 id="org45780a4"><span class="section-number-3">3.6.</span> Insert Hyperlinks To EBooks And Audio In Org-Mode</h3>
</div>

<div id="outline-container-orgd0a30ea" class="outline-3">
<h3 id="orgd0a30ea"><span class="section-number-3">3.7.</span> Review Notes, Follow Hyperlinks To Review Original Material</h3>
</div>
</div>

<div id="outline-container-org7190536" class="outline-2">
<h2 id="org7190536"><span class="section-number-2">4.</span> Software Components That Enable This Experience</h2>
</div>

<div id="outline-container-org94f70ee" class="outline-2">
<h2 id="org94f70ee"><span class="section-number-2">5.</span> Conclusion: Looking Back, Looking Forward</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-10-14 Fri 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2022-10-14 Fri 08:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
